app/controllers/pages_controller.rb

  def landing_page
      @featured_product = Product.find(3)
---
SELECT  "products".* FROM "products"  WHERE "products"."id" = ? LIMIT 1  [["id", 3]]