app/controllers/products_controller.rb

  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("created_at", "description", "image_url", "name", "prices", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", "2014-09-05 13:02:12.853203"], ["description", "This is a product"], ["image_url", ""], ["name", "Product"], ["prices", "87"], ["updated_at", "2014-09-05 13:02:12.853203"]]

  def update
    respond_to do |format|
      if @product.update(product_params)
---
UPDATE "products" SET "description" = ?, "name" = ?, "updated_at" = ? WHERE "products"."id" = 2  [["description", "The best solution for any museum who wants to go mobile."], ["name", "The Museum App"], ["updated_at", "2014-09-02 13:08:10.249862"]]